-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Хост: MySQL-8.0
-- Время создания: Фев 10 2025 г., 16:24
-- Версия сервера: 8.0.35
-- Версия PHP: 8.1.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `restapi`
--

-- --------------------------------------------------------

--
-- Структура таблицы `post`
--

CREATE TABLE `post` (
  `id` int NOT NULL,
  `title` varchar(30) NOT NULL,
  `description` varchar(255) NOT NULL,
  `due_date` date NOT NULL,
  `create_date` date NOT NULL,
  `priority` varchar(50) NOT NULL,
  `category` varchar(50) NOT NULL,
  `status` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `post`
--

INSERT INTO `post` (`id`, `title`, `description`, `due_date`, `create_date`, `priority`, `category`, `status`) VALUES
(1, 'Задача1', 'Задача1 описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'не выполнена'),
(2, 'Задача2', 'Задача2 описание', '2025-02-13', '2025-02-01', 'низкий', 'Учёба', 'Выполнена'),
(3, 'Задача3 Изменено', 'Задача3 Изменено', '2025-03-09', '2025-02-09', 'Изменено средний', 'Изменено Личное', 'Изменено Выполнено'),
(5, 'Задача4', 'Задача4 Описание', '2024-03-09', '2024-02-09', 'Низкий', 'Дом', 'Не выполено'),
(8, 'Задача8', 'Задача8 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(9, 'Задача9', 'Задача9 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(10, 'Задача10', 'Задача10 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(11, 'Задача11', 'Задача11 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(12, 'Задача12', 'Задача12 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(13, 'Задача13', 'Задача13 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(14, 'Задача14', 'Задача14 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(15, 'Задача15', 'Задача15 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(16, 'Задача16', 'Задача16 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(17, 'Задача17', 'Задача17 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(18, 'Задача18', 'Задача18 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(19, 'Задача19', 'Задача19 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено'),
(20, 'Задача20', 'Задача20 Описание', '2025-01-20', '2025-01-20', 'высокий', 'Работа', 'Не выполено');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `post`
--
ALTER TABLE `post`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
